; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph0 - mode
	thermograph2 - mode
	infrared6 - mode
	spectrograph4 - mode
	image1 - mode
	infrared3 - mode
	image5 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation10 - direction
	GroundStation7 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image1)
	(supports instrument0 image5)
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared6)
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Star11 thermograph2)
	(have_image Star11 image1)
	(have_image Star12 infrared6)
	(have_image Star13 image5)
	(have_image Phenomenon14 infrared3)
	(have_image Phenomenon14 image5)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 0 of 7
3. (turn_to satellite0 phenomenon14 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 7
4. (take_image satellite0 phenomenon14 instrument0 image5)
   added: (have_image phenomenon14 image5)
   goals met: 1 of 7
5. (take_image satellite0 phenomenon14 instrument0 infrared3)
   added: (have_image phenomenon14 infrared3)
   goals met: 2 of 7
6. (turn_to satellite0 star1 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star1)
   goals met: 3 of 7
7. (turn_to satellite0 star11 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star11)
   goals met: 2 of 7
8. (take_image satellite0 star11 instrument0 image1)
   added: (have_image star11 image1)
   goals met: 3 of 7
9. (take_image satellite0 star11 instrument0 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 4 of 7
10. (turn_to satellite0 star1 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star1)
   goals met: 5 of 7
11. (turn_to satellite0 star12 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star12)
   goals met: 4 of 7
12. (take_image satellite0 star12 instrument0 infrared6)
   added: (have_image star12 infrared6)
   goals met: 5 of 7
13. (turn_to satellite0 star1 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star1)
   goals met: 6 of 7
14. (turn_to satellite0 star13 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star13)
   goals met: 5 of 7
15. (take_image satellite0 star13 instrument0 image5)
   added: (have_image star13 image5)
   goals met: 6 of 7
16. (turn_to satellite0 star1 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star1)
   goals met: 7 of 7
